Revit 2027 API
FabricArea.LapSplicePosition Property
 The fabric lap splice position in the fabric distribution.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricLapSplicePosition LapSplicePosition { get; set; }
Public Property LapSplicePosition As FabricLapSplicePosition
	Get
	Set
public:
property FabricLapSplicePosition LapSplicePosition {
	FabricLapSplicePosition get ();
	void set (FabricLapSplicePosition value);
}
member LapSplicePosition : FabricLapSplicePosition with get, set
Property Value
FabricLapSplicePosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace